### Terraform Plan: `staging/base`
```
Acquiring state lock. This may take a few moments...
module.networking.data.aws_ami.nat_amazon_linux: Reading...
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0709189b5dac0a479]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-0a70776b47e7aa611]
module.networking.data.aws_ami.nat_amazon_linux: Read complete after 1s [id=ami-0ef865bea9cabdaee]
module.networking.aws_subnet.this["private_rds"]: Refreshing state... [id=subnet-0f165c22c2f9f9abc]
module.networking.aws_subnet.this["private_db"]: Refreshing state... [id=subnet-0be40adbbf01575da]
module.networking.aws_security_group.nat: Refreshing state... [id=sg-027a8ffbeb8b73a06]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-043e198a9514b54cb]
module.networking.aws_subnet.this["public"]: Refreshing state... [id=subnet-0189294430d63297d]
module.networking.aws_subnet.this["private_app"]: Refreshing state... [id=subnet-0aea9285b053168c1]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-0b76f741f3363082b]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-025fa5b2f9df4daec]
module.networking.aws_instance.nat: Refreshing state... [id=i-0c2818ce32d42f730]
module.networking.aws_route_table_association.this["private_app"]: Refreshing state... [id=rtbassoc-0e3e298aa36fd6714]
module.networking.aws_route_table_association.this["private_db"]: Refreshing state... [id=rtbassoc-07c67e12a842dcbba]
module.networking.aws_route_table_association.this["private_rds"]: Refreshing state... [id=rtbassoc-078613c062239fd26]
module.networking.aws_route_table_association.this["public"]: Refreshing state... [id=rtbassoc-0835cf6d9d4190db9]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-02e258533ca787696]
module.networking.aws_route.private_nat: Refreshing state... [id=r-rtb-043e198a9514b54cb1080289494]
module.networking.aws_eip_association.nat: Refreshing state... [id=eipassoc-008ec950be32b4f1d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.networking.aws_route53_zone.internal will be created
  + resource "aws_route53_zone" "internal" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "staging.doktori.internal"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "staging.doktori.internal"
        }
      + tags_all            = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging.doktori.internal"
          + "Project"     = "doktori"
        }
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0709189b5dac0a479"
          + vpc_region = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ networking = {
      + internal_zone_id   = (known after apply)
      + internal_zone_name = "staging.doktori.internal"
        # (6 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```